models/deepseek-v2-lite/benchmark_results/p50_sweep_20260315_045416/sweep.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f3e4705d9e0>, seed=42, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=7870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_sweep_20260315_045416', result_filename='qps1_20260315_045416.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-703994b8-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 04:56:45 [datasets.py:611] Sampling input_len from [7869, 7869] and output_len from [252, 252]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [03:30<00:00,  1.05s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  210.07    
Total input tokens:                      2773800   
Total generated tokens:                  50400     
Request throughput (req/s):              0.95      
Output token throughput (tok/s):         239.92    
Peak output token throughput (tok/s):    525.00    
Peak concurrent requests:                22.00     
Total token throughput (tok/s):          13444.16  
---------------Time to First Token----------------
Mean TTFT (ms):                          1282.59   
Median TTFT (ms):                        1077.77   
P50 TTFT (ms):                           1077.77   
P90 TTFT (ms):                           1914.45   
P95 TTFT (ms):                           2050.20   
P99 TTFT (ms):                           2398.30   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          40.25     
Median TPOT (ms):                        40.01     
P50 TPOT (ms):                           40.01     
P90 TPOT (ms):                           42.54     
P95 TPOT (ms):                           43.07     
P99 TPOT (ms):                           44.52     
---------------Inter-token Latency----------------
Mean ITL (ms):                           40.25     
Median ITL (ms):                         37.06     
P50 ITL (ms):                            37.06     
P90 ITL (ms):                            38.81     
P95 ITL (ms):                            40.93     
P99 ITL (ms):                            136.12    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11384.64  
Median E2EL (ms):                        11427.39  
P50 E2EL (ms):                           11427.39  
P90 E2EL (ms):                           12203.01  
P95 E2EL (ms):                           12500.24  
P99 E2EL (ms):                           12897.72  
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x76eddaf556c0>, seed=42, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=7870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_sweep_20260315_045416', result_filename='qps2_20260315_045416.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-2f66e472-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 05:01:40 [datasets.py:611] Sampling input_len from [7869, 7869] and output_len from [252, 252]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [01:58<00:00,  1.68it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  118.96    
Total input tokens:                      2773800   
Total generated tokens:                  50400     
Request throughput (req/s):              1.68      
Output token throughput (tok/s):         423.67    
Peak output token throughput (tok/s):    517.00    
Peak concurrent requests:                44.00     
Total token throughput (tok/s):          23740.81  
---------------Time to First Token----------------
Mean TTFT (ms):                          7076.34   
Median TTFT (ms):                        7155.07   
P50 TTFT (ms):                           7155.07   
P90 TTFT (ms):                           11012.56  
P95 TTFT (ms):                           11476.78  
P99 TTFT (ms):                           12098.63  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          42.20     
Median TPOT (ms):                        42.11     
P50 TPOT (ms):                           42.11     
P90 TPOT (ms):                           45.96     
P95 TPOT (ms):                           46.05     
P99 TPOT (ms):                           46.09     
---------------Inter-token Latency----------------
Mean ITL (ms):                           42.20     
Median ITL (ms):                         37.34     
P50 ITL (ms):                            37.34     
P90 ITL (ms):                            41.48     
P95 ITL (ms):                            91.59     
P99 ITL (ms):                            136.71    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          17668.66  
Median E2EL (ms):                        18290.25  
P50 E2EL (ms):                           18290.25  
P90 E2EL (ms):                           21286.44  
P95 E2EL (ms):                           21757.81  
P99 E2EL (ms):                           22455.74  
==================================================